from datetime import datetime

LOCATION_CHOICES = [
    ('Бишкек', 'Бишкек'),
    ('Нарын', 'Нарын'),
    ('Талас', 'Талас'),
    ('Ыссык-көл', 'Ыссык-көл'),
    ('Баткен', 'Баткен'),
    ('Жалал-абад', 'Жалал-абад'),
    ('Ош', 'Ош'),
]
FUEL = [
    ('БЕНЗИН', 'Бензин'),
    ('Дизель', 'Дизель')
]

YEAR_CHOICES = [
    (year, year)
    for year in range(1960, datetime.now().year + 1)
]

DRIVE = [
    ('Задний', 'Задний'),
    ('Передний', 'Передный')
]
TYPE_BODY = [
    ('Седан', 'Cедан'),
    ('Универсал', 'Универсал'),
    ('Хетчбэк', 'Хетчбэк')
]

GEARBOX = [
    ('Механика', 'Механика'),
    ('Автомат', 'Автомат'),
]
STEERING_WHEEL = [
    ('Слева', 'Слева'),
    ('Справа', 'Справа')
]