FUEL = [
    ('БЕНЗИН', 'Бензин'),
    ('Дизель', 'Дизель')
]

DRIVE = [
    ('Задний', 'Задний'),
    ('Передний', 'Передный')
]
TYPE_BODY = [
    ('Седан', 'Cедан'),
    ('Универсал', 'Универсал'),
    ('Хетчбэк', 'Хетчбэк')
]

GEARBOX = [
    ('Механика', 'Механика'),
    ('Автомат', 'Автомат'),
]
STEERING_WHEEL = [
    ('Слева', 'Слева'),
    ('Справа', 'Справа')
]

STATE = [
    ('хорошее', 'хорошее'),
    ('идеальное', 'идеальное'),
    ('аварийное', 'аварийное'),
    ('новое', 'новое'),
]

AVAILABILITY = [
    ('В наличии', 'В наличии'),
    ('На заказ', 'На заказ'),
    ('В пути', 'В пути'),
]

CUSTOM_AUTO = [
    ('да ', 'да'),
    ('нет ', 'нет'),
]


CAR_REGIS_LOCATION_CHOICES = [
    ('Кыргызстан', 'Кыргызстан'),
    ('Абхазия', 'Абхазия'),
    ('Армения', 'Армения'),
    ('Казахстан', 'Казахстан'),
    ('Россия', 'Россия'),
    ('Другая страна', 'Другая страна'),
    ('Не стоит на учете', 'Не стоит на учете'),
]

DEAL_CONDITIONS_CHOICES = [
    ('soms', 'сом'),
    ('usd', 'долл. США'),
]

EXCHANGE_OPTION = [
    ('Возможность рассрочки', 'Возможность рассрочки'),
    ('рассмотрю варианты', 'рассмотрю варианты'),
    ('с доплатой покупателя', 'с доплатой покупателя'),
    ('с доплатой продавца', 'с доплатой продавца'),
    ('ключ на ключ', 'ключ на ключ'),
    ('обмен не предлагать', 'обмен не предлагать'),
    ('обмен на недвижимость', 'обмен на недвижимость'),
    ('только обмен', 'только обмен'),
]
